app/Http/Controllers/TataUsahaController.php

    public function detailGuru(Request $request, Guru $guru, GuruBK $guruBk, GuruPiket $guruPiket, Kelas $kelas)
    {
        $data = [
            "guru" => $guru
                        ->join('akun', 'guru.id_akun', '=','akun.id_akun')
                        ->where('id_guru', $request->id)->first(),
            "guruBk" => $guruBk->where('id_guru', $request->id)->first(),
            "guruPiket" => $guruPiket->where('id_guru', $request->id)->first(),
---
SELECT * FROM `guru_bk` WHERE `id_guru` = '16' LIMIT 1
SELECT * FROM `guru_piket` WHERE `id_guru` = '16' LIMIT 1