app/Http/Controllers/TataUsahaController.php

    public function showSiswa(Siswa $siswa)
    {
        $data = [
            'siswa' => $siswa
                ->join('kelas', 'siswa.id_kelas', '=', 'kelas.id_kelas')
                ->join('jurusan', 'kelas.id_jurusan', '=', 'jurusan.id_jurusan')->get()
        ];
---
SELECT * FROM `siswa` inner join `kelas` on `siswa`.`id_kelas` = `kelas`.`id_kelas` inner join `jurusan` on `kelas`.`id_jurusan` = `jurusan`.`id_jurusan`

    public function showGuru(GuruBk $guru_bk, GuruPiket $guru_piket, Kelas $kelas)
    {
        $data = [
            'guruBK' => $guru_bk
                ->join('guru', 'guru_bk.id_guru', '=', 'guru.id_guru')->get(),
            'guruPiket' => $guru_piket
                ->join('guru', 'guru_piket.id_guru', '=', 'guru.id_guru')->get(),
            'kelas' => $kelas
                ->join('guru', 'kelas.id_wali_kelas', '=', 'guru.id_guru')
                ->join('jurusan', 'kelas.id_jurusan', '=', 'jurusan.id_jurusan')->get(),
        ];
---
SELECT * FROM `guru_piket` inner join `guru` on `guru_piket`.`id_guru` = `guru`.`id_guru`
SELECT * FROM `guru_bk` inner join `guru` on `guru_bk`.`id_guru` = `guru`.`id_guru`

    public function showPengurus(PengurusKelas $pengurus)
    {
        $data = [
            'pengurus' => $pengurus
                ->join('siswa', 'siswa.id_siswa', '=', 'pengurus_kelas.id_siswa')
                ->join('kelas', 'siswa.id_kelas', '=', 'kelas.id_kelas')->get()
        ];
---
SELECT * FROM `pengurus_kelas` inner join `siswa` on `siswa`.`id_siswa` = `pengurus_kelas`.`id_siswa` inner join `kelas` on `siswa`.`id_kelas` = `kelas`.`id_kelas`
SELECT * FROM `kelas` inner join `guru` on `kelas`.`id_wali_kelas` = `guru`.`id_guru` inner join `jurusan` on `kelas`.`id_jurusan` = `jurusan`.`id_jurusan`

    public function showPresensi()
    {
        $data = [
            'presensi' => DB::table('view_presensi')->get()
        ];
---
SELECT * FROM `view_presensi`

    public function createSiswa(Kelas $kelas, Siswa $siswa)
    {
        $jenisKelamin = ['Laki-Laki', 'Perempuan'];

        $kelas = $kelas
            ->join('jurusan', 'kelas.id_jurusan', '=', 'jurusan.id_jurusan')
            ->get();
---
SELECT * FROM `kelas` inner join `jurusan` on `kelas`.`id_jurusan` = `jurusan`.`id_jurusan`

    public function createGuru(GuruBk $guru_bk, GuruPiket $guru_piket, Kelas $kelas)
    {
        $data = [
            'kelas' => $kelas->where('id_wali_kelas', null)
                ->join('jurusan', 'kelas.id_jurusan', '=', 'jurusan.id_jurusan')->get(),
        ];
---
SELECT * FROM `kelas` inner join `jurusan` on `kelas`.`id_jurusan` = `jurusan`.`id_jurusan` WHERE `id_wali_kelas` IS NULL

    public function editSiswa(Request $request, Kelas $kelas, Siswa $siswa)
    {
        $jenisKelamin = ['Laki-Laki', 'Perempuan'];

        $data = [
            "siswa" => $siswa->where('id_siswa', $request->id)
                ->join("kelas", "siswa.id_kelas", "=", "kelas.id_kelas")
                ->join("akun", "siswa.id_akun", "=", "akun.id_akun")
                ->first(),
            "kelas" => $kelas
                ->join('jurusan', 'kelas.id_jurusan', '=', 'jurusan.id_jurusan')
                ->get(),
            'jenisKelamin' => $jenisKelamin,

        ];
---
SELECT * FROM `siswa` inner join `kelas` on `siswa`.`id_kelas` = `kelas`.`id_kelas` inner join `akun` on `siswa`.`id_akun` = `akun`.`id_akun` WHERE `id_siswa` = '1' LIMIT 1
SELECT * FROM `kelas` inner join `jurusan` on `kelas`.`id_jurusan` = `jurusan`.`id_jurusan`

    public function editPengurus(Request $request, Kelas $kelas, PengurusKelas $pengurus)
    {
        $pengurus = [
            "pengurus" => $pengurus->join('siswa', 'pengurus_kelas.id_siswa', '=', 'siswa.id_siswa')
                ->where('id_pengurus', '=', $request->id)
                ->first()
        ];
---
SELECT * FROM `pengurus_kelas` inner join `siswa` on `pengurus_kelas`.`id_siswa` = `siswa`.`id_siswa` WHERE `id_pengurus` = '1' LIMIT 1

    public function editGuru(Request $request, Kelas $kelas, Guru $guru, GuruBk $guruBk, GuruPiket $guruPiket)
    {
        $guru = [
            "guru" => $guru->where('id_guru', $request->id)->first(),
            "guruBk" => $guruBk->where('id_guru', $request->id)->first(),
            "guruPiket" => $guruPiket->where('id_guru', $request->id)->first(),
            'kelas' => $kelas->all()
---
SELECT * FROM `guru` WHERE `id_guru` = '11' LIMIT 1
SELECT * FROM `guru_bk` WHERE `id_guru` = '11' LIMIT 1
SELECT * FROM `guru_piket` WHERE `id_guru` = '11' LIMIT 1
SELECT * FROM `kelas`

            if ($data) {
                $status = $request->input('status');

                if ($kelas->where('id_wali_kelas', $id_guru)->first()) {
                    $kelas->where('id_wali_kelas', $id_guru)->update(['id_wali_kelas' => null]);
---
SELECT * FROM `kelas` WHERE `id_wali_kelas` = '16' LIMIT 1
UPDATE `kelas` SET `id_wali_kelas` =  WHERE `id_wali_kelas` = '16'

                    $guruBk->where('id_guru', $id_guru)->delete();
                }

                $guru->where('id_guru', $id_guru)->update($data);
---
UPDATE `guru` SET `nama_guru` = 'Taufik Nurfauz', `pembuat` = 'Tata Usaha' WHERE `id_guru` = '16'

                    $guruBk->create(['id_guru' => $id_guru]);
                }
                if ($status == 'Guru Piket') {
                    $guruPiket->create(['id_guru' => $id_guru]);
---
INSERT INTO `guru_piket` (`id_guru`) VALUES ('16')

    public function destroyGuru(Request $request, Role $role, Kelas $kelas, GuruPiket $guruPiket, GuruBk $guruBk)
    {
        $id_guru = $request->input('id_guru');
        $user = Auth::user();
        $role_akun = $role->where('id_role', $user->id_role)->first('nama_role');
        $data['pembuat'] = $role_akun->nama_role;

        $guru = Guru::where('id_guru', $id_guru)->first();

        if ($guru) {
            if ($kelas->where('id_wali_kelas', $id_guru)->first()) {
                $kelas->where('id_wali_kelas', $id_guru)->update(['id_wali_kelas' => null]);
            }
            if ($guruPiket->where('id_guru', $id_guru)->first()) {
                $guruPiket->where('id_guru', $id_guru)->delete();
            }
            if ($guruBk->where('id_guru', $id_guru)->first()) {
                $guruBk->where('id_guru', $id_guru)->delete();
            }

            $pembuat = $guru->update($data);
            $hapus_guru = $guru->delete();
---
SELECT * FROM `guru` WHERE `id_guru` = '16' LIMIT 1
SELECT * FROM `kelas` WHERE `id_wali_kelas` = '16' LIMIT 1
DELETE FROM `guru_piket` WHERE `id_guru` = '16'
DELETE FROM `guru` WHERE `id_guru` = 16

    public function logs(Logs $logs)
    {
        $data = [
            'logs' => $logs::orderBy('id_log', 'desc')->get(),

        ];
---
SELECT * FROM `logs` ORDER BY `id_log` DESC